<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"34a2b76479b9ea762a6fd66e04af0e02aa9fcf2bde7476f4899df81df65acc93","plan_job_ref":"Job Terraform Plan #87 at https://github.com/cal-itp/data-infra/actions/runs/14460859111","plan_out_hash":"ec491dbcfb851ef025cee3ca90bf75954c568b3cd3bc79a8f41b545dbbea556f","plan_hash":"c40fe322ee93265e9411abcc981467e5a84f0a1633ee8d4a91262089cf7d80de","plan_text_format":"diff-trunc","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/gcs/us__
<details>
<summary>Plan: 403 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_iam_binding.calitp-staging-composer-composer-service-account will be updated in-place
!~  resource "google_storage_bucket_iam_binding" "calitp-staging-composer-composer-service-account" {
        id      = "b/calitp-staging-composer/roles/storage.legacyBucketOwner"
!~      members = [
-           "projectEditor:cal-itp-data-infra",
#            (3 unchanged elements hidden)
        ]
#        (3 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_county_geography.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_county_geography.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_county_geography.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_eligibility_programs.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_eligibility_programs.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_eligibility_programs.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_fare_systems.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_fare_systems.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_fare_systems.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_funding_programs.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_funding_programs.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_funding_programs.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_gtfs_datasets.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_gtfs_datasets.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_gtfs_datasets.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_gtfs_service_data.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_gtfs_service_data.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_gtfs_service_data.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_modes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_modes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_modes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_ntd_agency_info.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_ntd_agency_info.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_ntd_agency_info.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_organizations.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_organizations.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_organizations.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_place_geography.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_place_geography.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_place_geography.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_rider_requirements.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_rider_requirements.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_rider_requirements.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_services.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/california_transit_services.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/california_transit_services.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/generate_gtfs_download_configs.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/generate_gtfs_download_configs.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/generate_gtfs_download_configs.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_services.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_data_quality_issues_services.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_data_quality_issues_services.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_components.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_components.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_components.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_contracts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_contracts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_contracts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_organizations.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_organizations.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_organizations.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_products.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_products.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_products.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_service_components.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_service_components.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_service_components.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_services.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/airtable_loader_v2/transit_tech_stacks_services.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/airtable_loader_v2/transit_tech_stacks_services.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_prod_archiver_configs_to_test/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_prod_archiver_configs_to_test/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/copy_prod_archiver_configs_to_test/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_prod_archiver_configs_to_test/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_prod_archiver_configs_to_test/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/copy_prod_archiver_configs_to_test/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_prod_archiver_configs_to_test/copy_prod_archiver_configs_to_test.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_prod_archiver_configs_to_test/copy_prod_archiver_configs_to_test.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/copy_prod_archiver_configs_to_test/copy_prod_archiver_configs_to_test.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/README.md"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/README.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/README.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/METADATA.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/METADATA.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/METADATA.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_county_geography.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_county_geography.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_county_geography.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_eligibility_programs.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_eligibility_programs.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_eligibility_programs.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_fare_systems.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_fare_systems.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_fare_systems.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_funding_programs.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_funding_programs.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_funding_programs.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_datasets.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_service_data.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_service_data.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_gtfs_service_data.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_modes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_modes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_modes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_organizations.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_organizations.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_organizations.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_place_geography.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_place_geography.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_place_geography.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_rider_requirements.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_rider_requirements.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_rider_requirements.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_services.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_california_transit_services.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_california_transit_services.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_gtfs_datasets.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_gtfs_datasets.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_gtfs_datasets.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_issue_types.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_issue_types.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_issue_types.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_services.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_services.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_services.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_transit_data_quality_issues.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_transit_data_quality_issues.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_data_quality_issues_transit_data_quality_issues.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_components.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_components.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_components.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_contracts.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_contracts.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_contracts.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_data_schemas.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_data_schemas.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_data_schemas.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_organizations.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Terraform Plan #87](https://github.com/cal-itp/data-infra/actions/runs/14460859111)